#version: 0.2 - Trained by `huggingface/tokenizers`
Ġ 1
Ġ 0
Ġ 2
Ġ 5
Ġ 3
Ġ 6
Ġ 7
Ġ 4
Ġ 8
Ġ2 5
Ġ1 0
Ġ8 0
Ġ6 4
Ġ10 0
Ġ1 5
3 3
Ġ3 5
Ġ2 2
Ġ7 5
Ġ7 1
Ġ 9
7 5
Ġ5 2
Ġ6 1
6 7
Ġ3 1
Ġ1 2
Ġ5 4
Ġ7 4
Ġ5 5
Ġ5 3
Ġ3 33
Ġ7 3
Ġ1 3
Ġ1 4
Ġ4 4
Ġ3 4
6 67
Ġ7 2
Ġ6 3
Ġ7 0
Ġ4 5
Ġ4 9
Ġ6 5
Ġ4 3
Ġ2 3
Ġ3 2
Ġ22 5
Ġ1 75
Ġ6 2
Ġ12 5
Ġ2 4
Ġ6 67
Ġ2 75
33 3
Ġ3 3
Ġ6 0
Ġ5 6
Ġ5 7
Ġ1 1
Ġ3 75
Ġ3 6
Ġ4 2
Ġ4 6
Ġ7 6
Ġ7 9
Ġ31 4
Ġ6 8
Ġ61 4
Ġ71 3
Ġ5 1
Ġ6 7
Ġ71 4
Ġ32 5
Ġ6 6
Ġ1 333
Ġ61 3
Ġ22 3
Ġ52 4
Ġ22 4
Ġ7 7
Ġ9 6
Ġ5 8
Ġ31 5
Ġ4 1
Ġ31 3
Ġ1 667
Ġ9 5
Ġ8 4
Ġ5 9
Ġ2 333
Ġ2 667
Ġ3 667
Ġ52 5
Ġ61 5
Ġ333 3
Ġ7 8
Ġ52 3
Ġ8 7
Ġ71 2
Ġ6 9
Ġ61 2
Ġ9 0
Ġ4 8
Ġ71 5
Ġ4 7
Ġ9 3
Ġ4 0
Ġ22 2
Ġ8 2
Ġ2 1
Ġ8 3
Ġ8 1
Ġ5 0
Ġ8 8
Ġ3 7
Ġ31 2
Ġ8 6
Ġ8 5
Ġ9 2
Ġ8 9
Ġ9 7
Ġ1 6
Ġ9 1
Ġ3 9
Ġ31 6
Ġ9 4
Ġ3 8
Ġ9 8
Ġ52 2
Ġ9 9
Ġ10 1
Ġ71 1
Ġ11 0
Ġ10 4
Ġ61 1
Ġ10 2
Ġ10 3
Ġ2 6
Ġ52 6
Ġ10 5
Ġ10 8
Ġ10 6
Ġ61 6
Ġ22 1
Ġ10 7
Ġ12 7
Ġ10 9
Ġ71 6
Ġ31 1
Ġ3 0
Ġ22 6
Ġ2 8
Ġ1 67
Ġ41 7
Ġ52 1
Ġ2 9
Ġ2 7
Ġ31 7
1 7
Ġ1 7
Ġ1 8
Ġ8 33
Ġ52 7
8 3
Ġ58 3
Ġ91 7
Ġ11 2
Ġ11 7
Ġ12 6
Ġ18 33
Ġ2 0
Ġ61 7
Ġ108 3
Ġ12 0
Ġ11 4
Ġ1 9
Ġ11 3
Ġ11 8
Ġ11 1
Ġ12 4
Ġ12 1
Ġ14 17
Ġ11 6
Ġ11 9
Ġ11 5
Ġ12 2
Ġ19 17
Ġ15 83
Ġ11 67
Ġ12 3
Ġ71 7
Ġ42 5
Ġ25 83
Ġ20 83
Ġ13 2
Ġ13 4
Ġ12 9
Ġ12 8
Ġ24 17
Ġ13 1
Ġ13 6
Ġ21 67
Ġ29 17
Ġ13 7
Ġ1 33
Ġ13 0
Ġ13 5
Ġ4 75
Ġ30 83
Ġ28 33
Ġ4 667
Ġ22 7
Ġ34 17
Ġ31 8
Ġ5 75
Ġ51 67
Ġ39 17
Ġ61 9
Ġ5 667
Ġ5 333
Ġ6 75
Ġ6 333
Ġ7 75
Ġ7 667
Ġ8 75
Ġ8 667
Ġ10 75
Ġ10 333
Ġ100 83
Ġ9 75
Ġ61 67
Ġ12 75
Ġ44 17
Ġ62 5
Ġ60 83
Ġ11 75
Ġ41 67
Ġ59 17
Ġ82 5
Ġ38 33
Ġ102 5
Ġ61 8
Ġ52 8
