{"<|endoftext|>":0,"!":1,"\"":2,"#":3,"$":4,"%":5,"&":6,"'":7,"(":8,")":9,"*":10,"+":11,",":12,"-":13,".":14,"/":15,"0":16,"1":17,"2":18,"3":19,"4":20,"5":21,"6":22,"7":23,"8":24,"9":25,":":26,";":27,"<":28,"=":29,">":30,"?":31,"@":32,"A":33,"B":34,"C":35,"D":36,"E":37,"F":38,"G":39,"H":40,"I":41,"J":42,"K":43,"L":44,"M":45,"N":46,"O":47,"P":48,"Q":49,"R":50,"S":51,"T":52,"U":53,"V":54,"W":55,"X":56,"Y":57,"Z":58,"[":59,"\\":60,"]":61,"^":62,"_":63,"`":64,"a":65,"b":66,"c":67,"d":68,"e":69,"f":70,"g":71,"h":72,"i":73,"j":74,"k":75,"l":76,"m":77,"n":78,"o":79,"p":80,"q":81,"r":82,"s":83,"t":84,"u":85,"v":86,"w":87,"x":88,"y":89,"z":90,"{":91,"|":92,"}":93,"~":94,"¡":95,"¢":96,"£":97,"¤":98,"¥":99,"¦":100,"§":101,"¨":102,"©":103,"ª":104,"«":105,"¬":106,"®":107,"¯":108,"°":109,"±":110,"²":111,"³":112,"´":113,"µ":114,"¶":115,"·":116,"¸":117,"¹":118,"º":119,"»":120,"¼":121,"½":122,"¾":123,"¿":124,"À":125,"Á":126,"Â":127,"Ã":128,"Ä":129,"Å":130,"Æ":131,"Ç":132,"È":133,"É":134,"Ê":135,"Ë":136,"Ì":137,"Í":138,"Î":139,"Ï":140,"Ð":141,"Ñ":142,"Ò":143,"Ó":144,"Ô":145,"Õ":146,"Ö":147,"×":148,"Ø":149,"Ù":150,"Ú":151,"Û":152,"Ü":153,"Ý":154,"Þ":155,"ß":156,"à":157,"á":158,"â":159,"ã":160,"ä":161,"å":162,"æ":163,"ç":164,"è":165,"é":166,"ê":167,"ë":168,"ì":169,"í":170,"î":171,"ï":172,"ð":173,"ñ":174,"ò":175,"ó":176,"ô":177,"õ":178,"ö":179,"÷":180,"ø":181,"ù":182,"ú":183,"û":184,"ü":185,"ý":186,"þ":187,"ÿ":188,"Ā":189,"ā":190,"Ă":191,"ă":192,"Ą":193,"ą":194,"Ć":195,"ć":196,"Ĉ":197,"ĉ":198,"Ċ":199,"ċ":200,"Č":201,"č":202,"Ď":203,"ď":204,"Đ":205,"đ":206,"Ē":207,"ē":208,"Ĕ":209,"ĕ":210,"Ė":211,"ė":212,"Ę":213,"ę":214,"Ě":215,"ě":216,"Ĝ":217,"ĝ":218,"Ğ":219,"ğ":220,"Ġ":221,"ġ":222,"Ģ":223,"ģ":224,"Ĥ":225,"ĥ":226,"Ħ":227,"ħ":228,"Ĩ":229,"ĩ":230,"Ī":231,"ī":232,"Ĭ":233,"ĭ":234,"Į":235,"į":236,"İ":237,"ı":238,"Ĳ":239,"ĳ":240,"Ĵ":241,"ĵ":242,"Ķ":243,"ķ":244,"ĸ":245,"Ĺ":246,"ĺ":247,"Ļ":248,"ļ":249,"Ľ":250,"ľ":251,"Ŀ":252,"ŀ":253,"Ł":254,"ł":255,"Ń":256,"Ġ1":257,"Ġ0":258,"Ġ2":259,"Ġ5":260,"Ġ3":261,"Ġ6":262,"Ġ7":263,"Ġ4":264,"Ġ8":265,"Ġ25":266,"Ġ10":267,"Ġ80":268,"Ġ64":269,"Ġ100":270,"Ġ15":271,"33":272,"Ġ35":273,"Ġ22":274,"Ġ75":275,"Ġ71":276,"Ġ9":277,"75":278,"Ġ52":279,"Ġ61":280,"67":281,"Ġ31":282,"Ġ12":283,"Ġ54":284,"Ġ74":285,"Ġ55":286,"Ġ53":287,"Ġ333":288,"Ġ73":289,"Ġ13":290,"Ġ14":291,"Ġ44":292,"Ġ34":293,"667":294,"Ġ72":295,"Ġ63":296,"Ġ70":297,"Ġ45":298,"Ġ49":299,"Ġ65":300,"Ġ43":301,"Ġ23":302,"Ġ32":303,"Ġ225":304,"Ġ175":305,"Ġ62":306,"Ġ125":307,"Ġ24":308,"Ġ667":309,"Ġ275":310,"333":311,"Ġ33":312,"Ġ60":313,"Ġ56":314,"Ġ57":315,"Ġ11":316,"Ġ375":317,"Ġ36":318,"Ġ42":319,"Ġ46":320,"Ġ76":321,"Ġ79":322,"Ġ314":323,"Ġ68":324,"Ġ614":325,"Ġ713":326,"Ġ51":327,"Ġ67":328,"Ġ714":329,"Ġ325":330,"Ġ66":331,"Ġ1333":332,"Ġ613":333,"Ġ223":334,"Ġ524":335,"Ġ224":336,"Ġ77":337,"Ġ96":338,"Ġ58":339,"Ġ315":340,"Ġ41":341,"Ġ313":342,"Ġ1667":343,"Ġ95":344,"Ġ84":345,"Ġ59":346,"Ġ2333":347,"Ġ2667":348,"Ġ3667":349,"Ġ525":350,"Ġ615":351,"Ġ3333":352,"Ġ78":353,"Ġ523":354,"Ġ87":355,"Ġ712":356,"Ġ69":357,"Ġ612":358,"Ġ90":359,"Ġ48":360,"Ġ715":361,"Ġ47":362,"Ġ93":363,"Ġ40":364,"Ġ222":365,"Ġ82":366,"Ġ21":367,"Ġ83":368,"Ġ81":369,"Ġ50":370,"Ġ88":371,"Ġ37":372,"Ġ312":373,"Ġ86":374,"Ġ85":375,"Ġ92":376,"Ġ89":377,"Ġ97":378,"Ġ16":379,"Ġ91":380,"Ġ39":381,"Ġ316":382,"Ġ94":383,"Ġ38":384,"Ġ98":385,"Ġ522":386,"Ġ99":387,"Ġ101":388,"Ġ711":389,"Ġ110":390,"Ġ104":391,"Ġ611":392,"Ġ102":393,"Ġ103":394,"Ġ26":395,"Ġ526":396,"Ġ105":397,"Ġ108":398,"Ġ106":399,"Ġ616":400,"Ġ221":401,"Ġ107":402,"Ġ127":403,"Ġ109":404,"Ġ716":405,"Ġ311":406,"Ġ30":407,"Ġ226":408,"Ġ28":409,"Ġ167":410,"Ġ417":411,"Ġ521":412,"Ġ29":413,"Ġ27":414,"Ġ317":415,"17":416,"Ġ17":417,"Ġ18":418,"Ġ833":419,"Ġ527":420,"83":421,"Ġ583":422,"Ġ917":423,"Ġ112":424,"Ġ117":425,"Ġ126":426,"Ġ1833":427,"Ġ20":428,"Ġ617":429,"Ġ1083":430,"Ġ120":431,"Ġ114":432,"Ġ19":433,"Ġ113":434,"Ġ118":435,"Ġ111":436,"Ġ124":437,"Ġ121":438,"Ġ1417":439,"Ġ116":440,"Ġ119":441,"Ġ115":442,"Ġ122":443,"Ġ1917":444,"Ġ1583":445,"Ġ1167":446,"Ġ123":447,"Ġ717":448,"Ġ425":449,"Ġ2583":450,"Ġ2083":451,"Ġ132":452,"Ġ134":453,"Ġ129":454,"Ġ128":455,"Ġ2417":456,"Ġ131":457,"Ġ136":458,"Ġ2167":459,"Ġ2917":460,"Ġ137":461,"Ġ133":462,"Ġ130":463,"Ġ135":464,"Ġ475":465,"Ġ3083":466,"Ġ2833":467,"Ġ4667":468,"Ġ227":469,"Ġ3417":470,"Ġ318":471,"Ġ575":472,"Ġ5167":473,"Ġ3917":474,"Ġ619":475,"Ġ5667":476,"Ġ5333":477,"Ġ675":478,"Ġ6333":479,"Ġ775":480,"Ġ7667":481,"Ġ875":482,"Ġ8667":483,"Ġ1075":484,"Ġ10333":485,"Ġ10083":486,"Ġ975":487,"Ġ6167":488,"Ġ1275":489,"Ġ4417":490,"Ġ625":491,"Ġ6083":492,"Ġ1175":493,"Ġ4167":494,"Ġ5917":495,"Ġ825":496,"Ġ3833":497,"Ġ1025":498,"Ġ618":499,"Ġ528":500}